# St7TrimMultiPointLinks

Removes free nodes from selected multi-point links.

long St7TrimMultiPointLinks(long uID)
Input Parameters
uID
Strand7 model file ID.
Dependencies
Selection
Links can be selected using functions in Entity Selection.
Keep Selected
Assigned using St7SetKeepSelect

Tools – Align